# General

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/cask-fonts'

# Commands
brew 'bash'
brew 'bash-completion'

brew 'curl'
brew 'wget'
brew 'rsync'

brew 'tree'
brew 'pstree'

brew 'p7zip'
brew 'unrar'
brew 'xz'
cask 'the-unarchiver'

# Utils
brew 'binutils'
brew 'coreutils'
brew 'moreutils'
cask 'etcher'
cask 'macs-fan-control'

# Display, Drawing
cask 'adobe-acrobat-reader'
brew 'imagemagick'
brew 'gnuplot'
brew 'graphviz'

# Video
cask 'vlc'
cask 'handbrake'
cask 'metaz'
cask 'avidemux'
cask 'lightworks'
cask 'kodi'

# Sound
brew 'lame'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'brave'
cask 'opera'

# Data Storage
cask 'dropbox'
cask 'google-drive'
brew 'gdrive'

# Emails
cask 'postbox'

# Social
cask 'slack'
cask 'skype'
cask 'whatsapp'
cask 'franz'
cask 'microsoft-teams'

# P2P
cask 'transmission'
cask 'soulseek'

# Games
#brew 'cgoban'
#brew 'gnu-go'
#brew 'pachi'
brew 'boost'
#brew 'fuego'
cask 'leela'
brew 'leiningen'
#cask 'leelaz'
#autogtp
brew 'qt5'
# trackmania :-)
cask 'porting-kit'
cask 'minecraft'

# Hobbies
#cask 'opencpn'

# Kids
#cask 'scratch'
cask 'mu-editor'

# Security/Network
brew 'openssl'
brew 'gnupg2'
brew 'pinentry-mac'
cask 'wireshark'
cask 'netspot'
cask 'nordvpn'

# Network
brew 'nmap'
cask 'gns3'
cask 'angry-ip-scanner'

# Editors, IDE
cask 'atom'
cask 'visual-studio-code'
cask 'intellij-idea-ce'
cask 'sourcetree'
cask 'android-studio'

# Application Management
cask 'appcleaner'
cask 'teamviewer'
cask 'disk-inventory-x'

# Desktop Board
cask 'keepingyouawake'
cask 'flux'
cask 'stay'
cask 'coconutbattery'
cask 'timemachineeditor'

# Get The Things Done
cask 'timing'
#cask 'omnifocus'
cask 'xmind'

# Documents
cask 'mactex'
brew 'bib-tool'
cask 'jabref'
cask 'lyx'
cask 'libreoffice'

brew 'aspell', args: ['with-lang-fr', 'with-lang-en']
cask 'grammarly'

# Documentation
brew 'pandoc'
brew 'asciidoctor'
brew 'docbook'
brew 'docbook-xsl'

# Fonts
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-ubuntu'
cask 'font-yanone-kaffeesatz'
cask 'font-noto-sans'
cask 'font-noto-emoji'
cask 'font-noto-color-emoji'
cask 'font-noto-serif'
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-montserrat'
cask 'font-fontawesome'
cask 'font-cascadia'

# Versioning
brew 'git'
brew 'git-extras'
brew 'mercurial'
brew 'repo'
brew 'gource'

brew 'jenv'
brew 'rbenv'

# Tool Chains
brew 'ant'
brew 'maven'
brew 'gradle'
brew 'cmake'

# Dev
cask 'dash'
cask 'postman'

# Application Deployment
cask 'virtualbox'
brew 'hyperkit'
cask 'docker'
brew 'docker-machine-driver-hyperkit'
cask 'minikube'

# Programming Languages
#cask 'java'
cask 'java8'
brew 'gcc'
brew 'go'
brew 'golo'
brew 'groovy'
brew 'scala'
brew 'node'
brew 'python'
brew 'kotlin'
brew 'ruby-build'

# Web Applications
brew 'influxdb'
brew 'grafana'

# Middleware
brew 'vert.x'

# Science
cask 'knime'
# Sumo
#cask 'xquartz'
#brew 'sumo'
# ndnSIM
#brew 'boost@1.60' 
#brew 'cryptopp' 
#brew 'pkg-config'
#brew 'openssl'
#brew 'libxml2'
#brew 'gtk+'
#brew 'castxml'
#cask 'macports'

