# General

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Commands
brew 'bash'
brew 'bash-completion'
brew 'noti'

brew 'curl'
brew 'wget'
brew 'rsync'
brew 'lftp'
brew 'httpie'
brew 'aria2'

brew 'fd'
brew 'bat'
brew 'tree'
brew 'pstree'
brew 'duff'

brew 'p7zip'
brew 'unrar'
brew 'xz'
cask 'the-unarchiver'

# Utils
brew 'binutils'
brew 'coreutils'
brew 'moreutils'
brew 'memtester'
cask 'balenaetcher'
cask 'macs-fan-control'
cask 'clipy'
cask 'stats'

# Display, Drawing
cask 'adobe-acrobat-reader'
brew 'gnuplot'
brew 'graphviz'
cask 'drawio'
cask 'obsidian'
cask 'openboard'
cask 'geogebra'

# Image
brew 'jhead'
brew 'imagemagick'

# Video
cask 'vlc'
brew 'ffmpeg'
cask 'handbrake'
cask 'metaz'
cask 'avidemux'
cask 'lightworks'
cask 'plex'
cask 'plex-media-server'

# Sound & Music
brew 'lame'
cask 'amazon-music'
cask 'spotify'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'opera'
cask 'brave-browser'
cask 'microsoft-edge'

# Data Storage
cask 'dropbox'
cask 'google-drive'
brew 'gdrive'

# Emails
cask 'postbox'

# Social
cask 'slack'
cask 'skype'
cask 'whatsapp'
#cask 'signal'
cask 'rambox-ce'
cask 'microsoft-teams'
cask 'discord'
cask 'zoom'
cask 'webex'

# P2P
cask 'transmission'
cask 'soulseek'

# Games
brew 'gnu-go'
brew 'pachi'
brew 'fuego'
cask 'leela'
brew 'leela-zero'
brew 'katago'
cask 'sabaki'
#autogtp
brew 'qt@5'
# trackmania :-)
cask 'porting-kit'
cask 'minecraft'
cask 'epic-games'

# Reading
cask 'kindle'

# Kids
#cask 'scratch'
#cask 'mu-editor'

# Security/Network
brew 'openssl'
brew 'gnupg'
brew 'pinentry-mac'
brew 'gpgme'
cask 'wireshark'
cask 'netspot'
cask 'nordvpn'

# Network
brew 'nmap'
brew 'bandwhich'
brew 'iproute2mac'
brew 'iperf3'
cask 'angry-ip-scanner'
cask 'cyberduck'

# Editors, IDE
cask 'atom'
cask 'visual-studio-code'
cask 'intellij-idea-ce'
cask 'sourcetree'
cask 'android-studio'

# Application Management
cask 'appcleaner'
cask 'teamviewer'
cask 'disk-inventory-x'
cask 'onyx'

# Desktop Board
cask 'keepingyouawake'
cask 'flux'
cask 'coconutbattery'
cask 'timemachineeditor'

# Get The Things Done
cask 'timing'
#cask 'omnifocus'
cask 'xmind'
cask 'raindropio'
cask 'meetingbar'
cask 'timer'

# Documents
cask 'mactex'
brew 'bib-tool'
cask 'jabref'
cask 'lyx'
cask 'libreoffice'
cask 'microsoft-office'

brew 'aspell', args: ['with-lang-fr', 'with-lang-en']
cask 'grammarly'

cask 'zotero'
#cask 'mendeley'

# Documentation
brew 'pandoc'
brew 'asciidoctor'
brew 'docbook'
brew 'docbook-xsl'
brew 'latex2html'

# Fonts
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
cask 'font-source-sans-3'
cask 'font-source-serif-4'
cask 'font-open-sans'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-ubuntu'
cask 'font-yanone-kaffeesatz'
cask 'font-noto-sans'
cask 'font-noto-emoji'
cask 'font-noto-color-emoji'
cask 'font-noto-serif'
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-montserrat'
cask 'font-fontawesome'
cask 'font-cascadia-code'
cask 'font-cascadia-mono'

# Versioning
brew 'git'
brew 'git-extras'
brew 'mercurial'
brew 'repo'
brew 'gource'

brew 'jenv'
brew 'rbenv'
brew 'virtualenvwrapper' #python

# Tool Chains
brew 'ant'
brew 'maven'
brew 'gradle'
brew 'cmake'

# Dev
cask 'dash'
cask 'postman'
brew 'doxygen'

# Application Deployment
cask 'virtualbox'
cask 'multipass'
brew 'hyperkit'
brew 'docker'
brew 'docker-machine-driver-hyperkit'
brew 'minikube'

# Programming Languages
brew 'java'
brew 'gcc'
brew 'go'
brew 'golo'
brew 'groovy'
brew 'scala'
brew 'node'
brew 'python'
brew 'kotlin'
brew 'ruby-build'
brew 'R'

# Web Applications
brew 'influxdb'
brew 'influxdb-cli'
brew 'grafana'

# Middleware
brew 'vert.x'
brew 'mosquitto'

# Science - data science
cask 'knime'

# Science - python modules
brew 'numpy'
brew 'python-matplotlib'

# Science - computation simulators
brew 'simgrid'

# Science - mobility simulator
#cask 'xquartz'
#brew 'sumo'

# Science - network simulators
#
# ndnSIM
#brew 'boost@1.60' 
#brew 'cryptopp' 
#brew 'pkg-config'
#brew 'openssl'
#brew 'libxml2'
#brew 'gtk+'
#brew 'castxml'
#cask 'macports'
#
# NS3
#brew 'gobject-introspection'
#brew 'libffi'
#brew 'goocanvas'
#pip3 install pycairo
#pip3 install pygraphviz
#pip3 install pygobject
#brew 'castxml'
#pip3 install pygccxml
#
# GNS3
cask 'gns3'
