# General

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'buo/cask-upgrade'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'caskroom/fonts'
tap 'homebrew/science'

# Commands
brew 'bash'
brew 'bash-completion'

brew 'curl'
brew 'wget'
brew 'rsync'

brew 'tree'
brew 'pstree'

brew 'p7zip'
brew 'unrar'
brew 'xz'
cask 'the-unarchiver'

# Utils
brew 'binutils'
brew 'coreutils'
brew 'moreutils'

# Display, Drawing
cask 'adobe-acrobat-reader'
brew 'imagemagick'
brew 'gnuplot'
brew 'graphviz'

# Video
cask 'vlc'
cask 'handbrake'
cask 'metaz'

# Sound
brew 'lame'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Data Storage
cask 'dropbox'
cask 'google-drive'
brew 'gdrive'

# Emails
cask 'postbox'

# Social
cask 'slack'
cask 'skype'
cask 'whatsapp'

# P2P
cask 'transmission'
cask 'soulseek'

# Games
#brew 'cgoban'
#brew 'gnu-go'
#brew 'pachi'
#brew 'fuego'
cask 'leela'

# Security
brew 'openssl'
brew 'gnupg2'
brew 'pinentry-mac'
brew 'nmap'
cask 'wireshark'
cask 'nordvpn'

# Editors, IDE
cask 'atom'
cask 'visual-studio-code'
cask 'intellij-idea-ce'
cask 'sourcetree'

# Application Management
cask 'appcleaner'
cask 'teamviewer'

# Desktop Board
cask 'keepingyouawake'
cask 'flux'
cask 'stay'
cask 'coconutbattery'
cask 'timemachineeditor'

# Get The Things Done
cask 'timing'
cask 'omnifocus'

# Documents
cask 'mactex'
cask 'jabref'
cask 'lyx'
cask 'libreoffice'

brew 'aspell', args: ['with-lang-fr', 'with-lang-en']
cask 'grammarly'

# Documentation
brew 'pandoc'
brew 'docbook'
brew 'docbook-xsl'

# Fonts
cask 'caskroom/fonts/font-inconsolata'
cask 'caskroom/fonts/font-roboto'
cask 'caskroom/fonts/font-roboto-condensed'
cask 'caskroom/fonts/font-roboto-mono'
cask 'caskroom/fonts/font-roboto-slab'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-source-sans-pro'
cask 'caskroom/fonts/font-source-serif-pro'
cask 'caskroom/fonts/font-open-sans'
cask 'caskroom/fonts/font-open-sans-condensed'
cask 'caskroom/fonts/font-pt-mono'
cask 'caskroom/fonts/font-pt-sans'
cask 'caskroom/fonts/font-pt-serif'
cask 'caskroom/fonts/font-ubuntu'
cask 'caskroom/fonts/font-yanone-kaffeesatz'
cask 'caskroom/fonts/font-noto-sans'
cask 'caskroom/fonts/font-noto-emoji'
cask 'caskroom/fonts/font-noto-color-emoji'
cask 'caskroom/fonts/font-noto-serif'
cask 'caskroom/fonts/font-fira-code'
cask 'caskroom/fonts/font-hasklig'
cask 'caskroom/fonts/font-montserrat'
cask 'caskroom/fonts/font-fontawesome'

# Versioning
brew 'git'
brew 'git-extras'
brew 'mercurial'

brew 'jenv'
brew 'rbenv'

# Tool Chains
brew 'ant'
brew 'maven'
brew 'gradle'

# Dev
cask 'dash'
cask 'postman'

# Application Deployment
cask 'docker'

# Programming Languages
#cask 'java'
cask 'caskroom/versions/java8'
brew 'gcc'
brew 'go'
brew 'golo'
brew 'groovy'
brew 'scala'
brew 'node'
brew 'python'
brew 'python3'
brew 'kotlin'
brew 'ruby-build'

# Web Applications
brew 'influxdb'
brew 'grafana'

# Middleware
brew 'vert.x'

# Science
# Sumo
cask 'xquartz'
brew 'sumo'
# ndnSIM
brew 'cryptopp' 
brew 'pkg-config'
brew 'openssl'
brew 'libxml2'

